## Plan Result (test-backendappgateway)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-perftest-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw"
        name                              = "cft-aks01-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.48.79.250",
              + "10.48.95.250",
            ]
          + name         = "rpts-api"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - name                                = "adoption-cos-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/adoption-cos-api" -> null
          - probe_name                          = "adoption-cos-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/civil-general-applications" -> null
          - name                                = "civil-general-applications" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/civil-general-applications" -> null
          - probe_name                          = "civil-general-applications" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - name                                = "et-sya-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/et-sya-api" -> null
          - probe_name                          = "et-sya-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-cft-hearing-service" -> null
          - name                                = "hmc-cft-hearing-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/hmc-cft-hearing-service" -> null
          - probe_name                          = "hmc-cft-hearing-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-inbound-adapter" -> null
          - name                                = "hmc-hmi-inbound-adapter" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/hmc-hmi-inbound-adapter" -> null
          - probe_name                          = "hmc-hmi-inbound-adapter" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-outbound-adapter" -> null
          - name                                = "hmc-hmi-outbound-adapter" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/hmc-hmi-outbound-adapter" -> null
          - probe_name                          = "hmc-hmi-outbound-adapter" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - name                                = "ia-bail-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/ia-bail-case-api" -> null
          - probe_name                          = "ia-bail-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-hmcts-access" -> null
          - name                                = "idam-hmcts-access" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/idam-hmcts-access" -> null
          - probe_name                          = "idam-hmcts-access" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-testing-support-api" -> null
          - name                                = "idam-testing-support-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/idam-testing-support-api" -> null
          - probe_name                          = "idam-testing-support-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-user-dashboard" -> null
          - name                                = "idam-user-dashboard" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/idam-user-dashboard" -> null
          - probe_name                          = "idam-user-dashboard" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - name                                = "plum-recipe-backend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/plum-recipe-backend" -> null
          - probe_name                          = "plum-recipe-backend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-cos" -> null
          - name                                = "prl-cos" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/prl-cos" -> null
          - probe_name                          = "prl-cos" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-dgs" -> null
          - name                                = "prl-dgs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/prl-dgs" -> null
          - probe_name                          = "prl-dgs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - name                                = "sscs-hearings-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/sscs-hearings-api" -> null
          - probe_name                          = "sscs-hearings-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - name                                = "ts-translation-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/ts-translation-service" -> null
          - probe_name                          = "ts-translation-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "rpts-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "rpts-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/adoption-cos-api"
          + name                                = "adoption-cos-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/probes/adoption-cos-api"
          + probe_name                          = "adoption-cos-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Dis

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

viders/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/idam-user-dashboard" -> null
          - http_listener_name         = "idam-user-dashboard" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/idam-user-dashboard" -> null
          - name                       = "idam-user-dashboard" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/idam-user-dashboard"
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-user-dashboard"
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/idam-user-dashboard"
          + http_listener_name         = "idam-user-dashboard"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/idam-user-dashboard"
          + name                       = "idam-user-dashboard"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/plum-recipe-backend" -> null
          - backend_address_pool_name  = "plum-recipe-backend" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - backend_http_settings_name = "plum-recipe-backend" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/plum-recipe-backend" -> null
          - http_listener_name         = "plum-recipe-backend" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/plum-recipe-backend" -> null
          - name                       = "plum-recipe-backend" -> null
          - priority                   = 70 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/plum-recipe-backend"
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/plum-recipe-backend"
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + priority                   = 70
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-cos" -> null
          - backend_address_pool_name  = "prl-cos" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-cos" -> null
          - backend_http_settings_name = "prl-cos" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-cos" -> null
          - http_listener_name         = "prl-cos" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-cos" -> null
          - name                       = "prl-cos" -> null
          - priority                   = 40 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-cos"
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-cos"
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-cos"
          + http_listener_name         = "prl-cos"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-cos"
          + name                       = "prl-cos"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-dgs" -> null
          - backend_address_pool_name  = "prl-dgs" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-dgs" -> null
          - backend_http_settings_name = "prl-dgs" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-dgs" -> null
          - http_listener_name         = "prl-dgs" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-dgs" -> null
          - name                       = "prl-dgs" -> null
          - priority                   = 50 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-dgs"
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-dgs"
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-dgs"
          + http_listener_name         = "prl-dgs"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-dgs"
          + name                       = "prl-dgs"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - priority                   = 130 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + priority                   = 130
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - priority                   = 140 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + priority                   = 140
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpts-api"
          + id                         = (known after apply)
          + name                       = "rpts-api"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (25 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1412,"Program":"tfcmt","SHA1":"","Target":"test-backendappgateway","Vars":{}} -->